In [1]:
import pandas as pd
import numpy as np

IN THIS WILL SEE THREE TYPES OF INDEXING METHODS OF PANDAS

In [2]:
#create any dataframe for performing inndexing
data = np.arange(0,20).reshape(4,5)

In [3]:
data

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [6]:
df = pd.DataFrame(data,columns = ['c1','c2','c3','c4','c5'] , index = ['r1','r2','r3','r4'])

In [7]:
df

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19

Method-01
column name indexing

In [9]:
# for single column
df['c1']

r1     0
r2     5
r3    10
r4    15
Name: c1, dtype: int32

In [10]:
# for multiplle colummn
df[['c1','c2']]

    c1  c2
r1   0   1
r2   5   6
r3  10  11
r4  15  16

In [11]:
df[['c1','c2','c3','c4']]

    c1  c2  c3  c4
r1   0   1   2   3
r2   5   6   7   8
r3  10  11  12  13
r4  15  16  17  18

Method-2 Rowindexing(loc parameter) ,loc parameter used  for label indexing and can access multiple rows

In [12]:
# for sinngle row
df.loc['r1']

c1    0
c2    1
c3    2
c4    3
c5    4
Name: r1, dtype: int32

In [13]:
# for multiple rows
df.loc[['r1','r2']]

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9

In [14]:
df.loc[['r1','r2','r4']]

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r4  15  16  17  18  19

Method-3 rowindex and columnindex (iloc parameter), iloc parameter used for integer indexing

In [15]:
# example
df

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19

In [17]:
# suppose i want only 123 value from my  dataframe
#df.iloc[rowindex,columnindex]
df.iloc[0,1:4]

c2    1
c3    2
c4    3
Name: r1, dtype: int32

In [18]:
df.iloc[1:3,1:3]

    c2  c3
r2   6   7
r3  11  12

In [19]:
df.iloc[2:,3:]

    c4  c5
r3  13  14
r4  18  19

In [20]:
df.iloc[0:2,2:4]

    c3  c4
r1   2   3
r2   7   8

# now will see different ways of inserting and deleting columns

INSERTING COLUMN

In [21]:
df

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19

In [22]:
# inserting new column
df.insert(3,'c4_c5',[1,2,3,4])

In [23]:
df

    c1  c2  c3  c4_c5  c4  c5
r1   0   1   2      1   3   4
r2   5   6   7      2   8   9
r3  10  11  12      3  13  14
r4  15  16  17      4  18  19

In [24]:
df.insert(6,'c6',df['c1'])

In [25]:
df

    c1  c2  c3  c4_c5  c4  c5  c6
r1   0   1   2      1   3   4   0
r2   5   6   7      2   8   9   5
r3  10  11  12      3  13  14  10
r4  15  16  17      4  18  19  15

In [26]:
#another way of inserting column
df['c7'] = [1,2,3,4]

In [27]:
df

    c1  c2  c3  c4_c5  c4  c5  c6  c7
r1   0   1   2      1   3   4   0   1
r2   5   6   7      2   8   9   5   2
r3  10  11  12      3  13  14  10   3
r4  15  16  17      4  18  19  15   4

In [28]:
df['c8'] = df['c2']

In [29]:
df

    c1  c2  c3  c4_c5  c4  c5  c6  c7  c8
r1   0   1   2      1   3   4   0   1   1
r2   5   6   7      2   8   9   5   2   6
r3  10  11  12      3  13  14  10   3  11
r4  15  16  17      4  18  19  15   4  16

DELETING COLUMNS

In [30]:
# Firts method of deleting column
df.pop('c4_c5')

r1    1
r2    2
r3    3
r4    4
Name: c4_c5, dtype: int64

In [31]:
df

    c1  c2  c3  c4  c5  c6  c7  c8
r1   0   1   2   3   4   0   1   1
r2   5   6   7   8   9   5   2   6
r3  10  11  12  13  14  10   3  11
r4  15  16  17  18  19  15   4  16

In [32]:
#second method of deleting column
del df['c7']

In [33]:
df

    c1  c2  c3  c4  c5  c6  c8
r1   0   1   2   3   4   0   1
r2   5   6   7   8   9   5   6
r3  10  11  12  13  14  10  11
r4  15  16  17  18  19  15  16

In [42]:
#third  method of deleting column
df.drop('c6',axis=1,inplace=True)

In [43]:
df

    c1  c2  c3  c4  c5  c8
r1   0   1   2   3   4   1
r2   5   6   7   8   9   6
r3  10  11  12  13  14  11
r4  15  16  17  18  19  16

In [44]:
#by using  this method we can able to delete multiple columns
df.drop(['c5','c8'],axis=1,inplace=True)

In [45]:
df

    c1  c2  c3  c4
r1   0   1   2   3
r2   5   6   7   8
r3  10  11  12  13
r4  15  16  17  18